# "1st program"
"Задача 1 (просто) Арифметика"

print(9 ** 0.5 * 5)

# "2nd program"
"Задача 2 (просто) Логика"

print(9.99 > 9.98 and 1000 != 1000.1)

# "3rd program"
"Задача 3 (средне) 'Школьная загадка'"

print(2 * 2 + 2)
print(2 * (2 + 2 ))
print((2 * 2 + 2) == (2 * (2 + 2)))

# 4th program
"Задача 4 (сложно) 'Первый после точки'"
example = '123.456'
print(example[4])
print(str(123.456))
print(type('123.456'))
print(123.456 * 10)
print(int(1234.56 * 10 * 10 ))
print(123456 % 10)









